src/DataProcessors/ПодготовкаСведенийВКаталогGS46.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПодготовкаСведенийВКаталогGS46</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Comment>Дата, до наступления которой допускается редактировать все поля у регистрируемого товара.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла формируемых сведений. Указание расширения ".xls" не обязательно.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Comment>GTIN, присвоенный производителем или импортером из диапазона национальных префиксов 460-469</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование товара, которое отражает все отличительные характеристики, по которым потребитель может отличить один товар от другого. Допускаются сокращения.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяМарка</Name>
							<Comment>Торговая марка, под которой товар реализуется на рынке.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПроизводителя</Name>
							<Comment>ИНН российского производителя или импортера</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроизводства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбуви</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалВерха</Name>
							<Comment>Материал верха изделия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалПодкладки</Name>
							<Comment>Материал подкладки изделия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалНиза</Name>
							<Comment>Материал низа изделия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Comment>Цвет изделия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Comment>Размер изделия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерДиапазон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПодготовкаСведенийВКаталогGS46/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	СтранаМираРоссия = Справочники.КлассификаторСтранМира.Россия;
	Продукция = Новый Массив();
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если Продукция.Найти(СтрокаТЧ.Номенклатура) = Неопределено Тогда
			Продукция.Добавить(СтрокаТЧ.Номенклатура);
		КонецЕсли;
	
		Если СтрокаТЧ.СтранаПроизводства = СтранаМираРоссия Тогда
			АдресОшибки = " " + СтрШаблон(НСтр("ru='в строке %1 списка ""Товары""'"), СтрокаТЧ.НомерСтроки);
			
			Если ПустаяСтрока(СтрокаТЧ.Цвет) Тогда
				ПолеОшибки  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "Цвет");
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Цвет""'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки + АдресОшибки,, ПолеОшибки, "Объект", Отказ);
			КонецЕсли;
			
			Если ПустаяСтрока(СтрокаТЧ.Размер) Тогда
				ПолеОшибки  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "Размер");
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Размер""'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки + АдресОшибки,, ПолеОшибки, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Артикулы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Продукция, "Артикул");
	
	Для Каждого Артикул Из Артикулы Цикл
		Если Не ЗначениеЗаполнено(Артикул.Значение) Тогда
			СтрокаТЧ    = Товары.Найти(Артикул.Ключ, "Номенклатура");
			АдресОшибки = " " + СтрШаблон(НСтр("ru='в строке %1 списка ""Товары""'"), СтрокаТЧ.НомерСтроки);
			ТекстОшибки = СтрШаблон(НСтр("ru='Не заполнен артикул номенклатуры ""%1""'"), СтрокаТЧ.Номенклатура);
			ПолеОшибки  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "Номенклатура");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки + АдресОшибки,, ПолеОшибки, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;

	МассивНепроверяемыхРеквизитов.Добавить("Товары.Цвет");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Размер");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
